#include <stdio.h>  // подключаем заголовочный файл stdio.h юзаем практически всегда
int main(void)                  // определяем функцию main
{                               // начало функции
    printf("Hello \n");       // выводим строку на консоль        
    int number = 33;
    printf("Ось число = %d \n", number);
    int x;// переменные як і в С# переменні чисел :
    int q,w,e;            // декілька перемен зразу 
    long wint = 221; // зараз можна буде юзати лонг місто інт так як інт міститьь тільки –32768 до 32767 (при 2 байтах) или от −2 147 483 648 до 2 147 483 647 (при 4 байтах) и вище.
    printf("Числа = %d \n", wint); // long  в дой час хранить -2 147 483 648 до 2 147 483 647 (4 байта), либо в диапазоне от -9223372036854775807 до +9 223 372 036 854 775 807 (8 байт)
    char greeting[] = "Hello, world!";
    printf("%s\n", greeting);
    return 0; // один раз в кінці функції - це іменований блок коду, який виконує певну задачу. Це як рецепт: ви даєте функції певні інгредієнти (аргументи), і вона повертає вам готовий результат

}



